Merge pull request #30 from SadDevastator/Telegraf-hotfix-+-documentation-update
